package lessons;

public class arrays {
    public static void main(String[] args) {
//===================================================================================================================================================================================================================\\
        //            СОКРАЩЕНИЯ ==== ARR - ARRAY; size - arr.length;

        //            МАТРИЦА, ВСЕГДА ДВУХМЕРНЫМ МАССИВ, А ДВУХМЕРНЫЙ МАССИВ НЕ ВСЕГДА МАТРИЦА
//===================================================================================================================================================================================================================\\
        // ТИП_ДАННЫХ[][][] НАЗВАНИЕ_МАССИВА = NEW ТИП_ДАННЫХ_ТАКОЙ_ЖЕ_КАК_И_У_МАССИВА[][][]; \\
        // ТИП_ДАННЫХ[] НАЗВАНИЕ_МАССИВА = {ЭЛЕМЕНТЫ_МАССИВА_ЧЕРЕЗ_ЗАПЯТУУУУУЮЮЮЮ}; \\

        //                                   !!!!!!! ВНИМАНИЕ !!!!!!                                \\

        // КОЛИЧЕСТВО [] ДОЛЖНО БЫТЬ РАВНООО !!!!! [] - одномерный массив, [] - двухмерный массив, [] - трёхмерный массив, и тд \\
//===================================================================================================================================================================================================================\\
        //                                   ОБРАЩЕНИЕ К ЭЛЕМЕНТАМ К МАССИВАМ                              \\

        // ИМЯ_МАССИВА[ИНДЕКС_ЭЛЕМЕТА]; !!!! ВАЖНО ПОНИМАТЬ, ЧТО ИНДЕКСАЦИЯ МАССИВОВ НАЧИНАЕТСЯ С 0. ТАКЖЕ МОЖНО ОСУЩЕСТВЛЯТЬ ИЗМЕНЕНИЕ ЭЛЕМЕНТА МАССИВА ЧЕРЕЗ ИМЯ_МАССИВА[ИНДЕКС_ЭЛЕМЕТА] = НОВОЕ_ЗНАЧЕНИЕ;
        // ТАКЖЕ ЗАПИСЬ МОЖЕТ БЫТЬ СЛЕДУЮЩАЯ
        //                              --- ИМЯ_МАССИВА[ИНДЕКС_ЭЛЕМЕТА][ИНДЕКС_МАССИВА_В_МАССИВЕ][ИНДЕКС_МАССИВА_В_МАССИВЕ_В_МАССИВЕ]; --- \\
//===================================================================================================================================================================================================================\\
        //                              int[] arr = new int[];

        //                              for (int el : arr) {};

        //                              for (ТИП_ЭЛЕМЕНТА_КОТОРЫЙ_ДОЛЖЕН_БЫТЬ_В_СЛЕД_ПЕРЕМЕННОЙ ИМЯ_ПЕРЕМЕННОЙ : МАССИВ) {};

        //                              for (int i = 0; i < size; i++) {};

        //                              ГДЕ i - какой-то индекс массива, size - размерность массива ( arr.length для простоты ), i++ - увеличение счётчика. {} - блок кода ( тут весь основной код for )

        //                              Чтобы пройтись по двухмерному массиву нужно делать for в for т. е. :
        //                              for (int i = 0; i < size; i++)
        //                              {
        //                                  for (int j = 0; j < size2; j++) {};
        //                              };
        //                              ГДЕ size - arr.length, а size2 - arr[i].length;

        //                              Для того, чтобы пройтись по трёхмерному массиву, мы просто добавляем третий for во второй for, получим
        //
        //                              for (int i = 0; i < size; i++)
        //                              {
        //                                  for (int j = 0; j < size2; j++) {
        //                                      for (int z = 0; z < size3; z++) {};
        //                                  };
        //                              };

        //                              ГДЕ size3 - arr[i][j].length; и тп
// ===================================================================================================================================================================================================================\\
        //
        //                    ==============================RANDOM=================================

        //                              Math.random() - вызов функции random, котороя возвращает дробное число от 0 до 1.
        //                              Если мы хотим записать значение в int, то нужно ЯВНО ПРЕОБРАЗОВАТЬ функцию в int, т.е.
        //                              int number = (int) (Math.random());

        //                              Если нам нужно любое другое число, то не сложно догадаться, что нужно просто сделать умножение на
        //                              нужное количество десятков, т.е.
        //
        //                              Math.random()*10  --- Число от 0 до 10.
        //                              Math.random()*100  --- Число от 0 до 100.
        //
        //                              Если нужно отрицательное, то нужно будет отнять нужное количество, т.е.
        //
        //                              Math.random()*100 - 50 -- числа от -50 до +50
        //                              Math.random()*200 - 100 -- числа от -100 до 100

        //                              Конечная запись (int) (Math.random()*100-50));
//===================================================================================================================================================================================================================\\

        int SIZEEEEEEEEE = 10;
        int[] array = new int[SIZEEEEEEEEE]; // обычный масив
        int[][] matrix = new int[10][10]; // матрица
        int[][] two_dimensional_ = new int[10][5]; //двухмерный массив
        int[][] two_dimensional = new int[5][10]; //двухмерный массив
        int[] aboba = {1, 2, 3, 4, 5};
        int[][] aboba2 = {
                {1, 2, 3},
                {4, 5, 6},
                {7, 8, 9}
        };

        //  !!!  System.out.print(array[100]); // ОШИБКА !!!!  МАССИВ ВЫШЕЛ ЗА ГРАНИЦЫ, ТАКОЕ ЖЕ БУДЕТ И ПРИ ОТРИЦАТЕЛЬНЫХ ИНДЕКСАХ

        for (int i = 0; i < SIZEEEEEEEEE; i++) {
            array[i] = (int) (1 + Math.random()*10); // числа от 1 до 10
        }
        for (int i = 0; i < matrix.length; i ++) {
            for (int j = 0; j < matrix[i].length; j++) {
                matrix[i][j] = (int) (Math.random()*10); // числа от 0 до 9
            }
        }
        for (int i = 0; i < 10; i ++) {
            for (int j = 0; j < 5; j++) {
                two_dimensional_[i][j] = (int) (Math.random()*10);
            }
        }
        for (int i = 0; i < 5; i ++) {
            for (int j = 0; j < 10; j++) {
                two_dimensional[i][j] = (int) (Math.random() * 10);
            }
        }

        for (int i = 0, j=aboba2.length-1; i < aboba2.length; i++, j--) {
            System.out.println(aboba2[i][j]);
        } // вывод побочной
        for (int i = 0; i < aboba2.length; i++) {
            System.out.println(aboba2[i][i]);
        } // вывод главной

        System.out.print("\n\n\n");

        for (int el : array) {
            System.out.print(el + " ");
        }

        System.out.print("\n\n\n");

        for (int i = 0; i < 10; i++) {
            for (int j = 0; j < 10; j++) {
                System.out.print(matrix[i][j] + " ");
            }
            System.out.println();
        }

        System.out.print("\n\n\n");

        for (int i = 0; i<10; i++) {
            for (int j = 0; j < 5; j++) {
                System.out.printf("%d ", matrix[i][j]);
            }

            System.out.println();
        }

        System.out.print("\n\n\n");

        for (int i = 0; i<5; i++) {
            for (int j = 0; j < 10; j++) {
                System.out.print(matrix[i][j] + " ");
            }

            System.out.println();
        }
    }
}